/**
 * 题目描述：
 *      你作为一名出道的歌手，终于要出专辑了，你计划收录n首歌，每首歌的时间都是s秒；
 *      每首歌必须完整的收录在一张CD当中，每张CD的容量长度是l秒，
 *      而且你必须保证一张CD里面两首歌的时间间隔至少要1秒。
 *      为了辟邪，你决定任意一张CD里面的歌数不能被13整除，
 *      那么请问，你出这张专辑，需要多少张CD？
 *
 * 输入描述：
 *      每组测试用例仅包含一组数据，m每组数据第一行三个数（n, s, L）。保证（n<=100, s<=L<=10000）
 *
 * 输出描述：
 *      输出一个整数代表你至少需要的CD数量。
 *
 * 输入例子： 7， 2， 6
 * 输出例子： 4
 *
 */


function getNum(n, s, l){
    var t = Math.floor((l+1)/(s+1));  //每张CD存多少首歌
    var num = 0;  //需要的CD数量

    if(n < t){
        if(n%13 === 0){
            return 2;
        }else{
            return 1;
        }
    }

    if(t%13 === 0){  //CD 的最大存歌量能被13整除，就减1
        t = t - 1;
    }

    //开始存歌
    while(Math.floor(n/t) !== 0){
        n = n - t;
        num++;
    }

    //处理剩余歌曲的存储问题
    if(n !== 0){  //如果剩余歌曲不为0
        if(n % 13 === 0){  //剩余歌曲正好能被13整除
            if(t - n === 1){  //与最大存歌量正好相差1，只能再用一张CD存一首歌
                num = num + 2;
            }else{  //最大存歌量比较大，可以将最后这个CD多放几首，之前满了的少放一首，交换一下，来实现存储
                num++;
            }
        }else{
            num ++;
        }
    }
    return num;
}

console.log(getNum(7, 2, 6));